In [1]:
%load_ext sql
%sql sqlite:///TYSQL.sqlite

In [7]:
%sql SELECT cust_id FROM Customers;

 * sqlite:///TYSQL.sqlite
Done.

[('1000000001',),
 ('1000000002',),
 ('1000000003',),
 ('1000000004',),
 ('1000000005',),
 ('1000000006',)]

In [8]:
%sql SELECT DISTINCT prod_id FROM OrderItems;

 * sqlite:///TYSQL.sqlite
Done.

[('BR01',),
 ('BR03',),
 ('BR02',),
 ('BNBG01',),
 ('BNBG02',),
 ('BNBG03',),
 ('RGAN01',)]

In [12]:
%sql SELECT cust_id FROM Customers;

 * sqlite:///TYSQL.sqlite
Done.

[('1000000001',),
 ('1000000002',),
 ('1000000003',),
 ('1000000004',),
 ('1000000005',),
 ('1000000006',)]

In [20]:
%sql SELECT cust_name FROM Customers ORDER BY cust_name DESC;

 * sqlite:///TYSQL.sqlite
Done.

[('Village Toys',),
 ('Toy Land',),
 ('The Toy Store',),
 ('Kids Place',),
 ('Fun4All',),
 ('Fun4All',)]

In [22]:
%sql SELECT cust_id, order_num FROM Orders ORDER BY cust_id, order_date DESC;

 * sqlite:///TYSQL.sqlite
Done.

[('1000000005', 20008),
 ('1000000004', 20007),
 ('1000000003', 20006),
 ('1000000001', 20005),
 ('1000000001', 20009)]

In [25]:
%sql SELECT quantity, item_price FROM OrderItems ORDER BY quantity DESC, item_price DESC;

 * sqlite:///TYSQL.sqlite
Done.

[(250, 2.49),
 (250, 2.49),
 (250, 2.49),
 (100, 10.99),
 (100, 5.49),
 (100, 2.99),
 (100, 2.99),
 (100, 2.99),
 (50, 11.49),
 (50, 4.49),
 (20, 5.99),
 (10, 11.99),
 (10, 8.99),
 (10, 3.49),
 (10, 3.49),
 (10, 3.49),
 (5, 11.99),
 (5, 4.99)]

In [28]:
%sql SELECT prod_id, prod_name FROM Products WHERE prod_price=9.49;

 * sqlite:///TYSQL.sqlite
Done.

[('RYL01', 'King doll'), ('RYL02', 'Queen doll')]

In [30]:
%sql SELECT DISTINCT order_num FROM OrderItems WHERE quantity >= 100;

 * sqlite:///TYSQL.sqlite
Done.

[(20005,), (20007,), (20009,)]

In [33]:
%sql SELECT prod_name, prod_price FROM Products WHERE prod_price BETWEEN 3 AND 6 ORDER BY prod_price;

 * sqlite:///TYSQL.sqlite
Done.

[('Fish bean bag toy', 3.49),
 ('Bird bean bag toy', 3.49),
 ('Rabbit bean bag toy', 3.49),
 ('Raggedy Ann', 4.99),
 ('8 inch teddy bear', 5.99)]

In [40]:
%sql SELECT vend_name FROM Vendors WHERE vend_state = 'CA' AND vend_country = 'USA'

 * sqlite:///TYSQL.sqlite
Done.

[('Doll House Inc.',)]

In [35]:
%sql SELECT * FROM Vendors LIMIT 1;

 * sqlite:///TYSQL.sqlite
Done.

[('BRS01', 'Bears R Us', '123 Main Street', 'Bear Town', 'MI', '44444', 'USA')]

In [41]:
%sql SELECT order_num, prod_id, quantity FROM OrderItems WHERE quantity >= 100 AND prod_id IN ('BR01','BR02','BR03')

 * sqlite:///TYSQL.sqlite
Done.

[(20005, 'BR01', 100), (20005, 'BR03', 100)]

In [43]:
%sql SELECT prod_name, prod_price FROM Products WHERE prod_price >= 3 AND prod_price < 6 ORDER BY prod_price;

 * sqlite:///TYSQL.sqlite
Done.

[('Fish bean bag toy', 3.49),
 ('Bird bean bag toy', 3.49),
 ('Rabbit bean bag toy', 3.49),
 ('Raggedy Ann', 4.99),
 ('8 inch teddy bear', 5.99)]

In [45]:
%sql SELECT prod_name, prod_desc FROM Products WHERE prod_desc LIKE '%toy%';

 * sqlite:///TYSQL.sqlite
Done.

[('Fish bean bag toy', 'Fish bean bag toy, complete with bean bag worms with which to feed it'),
 ('Bird bean bag toy', 'Bird bean bag toy, eggs are not included'),
 ('Rabbit bean bag toy', 'Rabbit bean bag toy, comes with bean bag carrots')]

In [51]:
%sql SELECT prod_name, prod_desc FROM Products WHERE NOT prod_desc LIKE '%toy%' ORDER BY prod_name;

 * sqlite:///TYSQL.sqlite
Done.

[('12 inch teddy bear', '12 inch teddy bear, comes with cap and jacket'),
 ('18 inch teddy bear', '18 inch teddy bear, comes with cap and jacket'),
 ('8 inch teddy bear', '8 inch teddy bear, comes with cap and jacket'),
 ('King doll', '12 inch king doll with royal garments and crown'),
 ('Queen doll', '12 inch queen doll with royal garments and crown'),
 ('Raggedy Ann', '18 inch Raggedy Ann doll')]

In [49]:
%sql SELECT prod_name, prod_desc FROM Products WHERE prod_desc LIKE '%toy%' AND prod_desc LIKE '%carrots%'

 * sqlite:///TYSQL.sqlite
Done.

[('Rabbit bean bag toy', 'Rabbit bean bag toy, comes with bean bag carrots')]

In [50]:
%sql SELECT prod_name, prod_desc FROM Products WHERE prod_desc LIKE '%toy%carrots%';

 * sqlite:///TYSQL.sqlite
Done.

[('Rabbit bean bag toy', 'Rabbit bean bag toy, comes with bean bag carrots')]

In [53]:
%sql SELECT Curdate();

 * sqlite:///TYSQL.sqlite
(sqlite3.OperationalError) no such function: Curdate
[SQL: SELECT Curdate();]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [55]:
%sql SELECT vend_id, vend_name AS vname, vend_address, vend_city AS vcity FROM Vendors ORDER BY vname;

 * sqlite:///TYSQL.sqlite
Done.

[('BRE02', 'Bear Emporium', '500 Park Street', 'Anytown'),
 ('BRS01', 'Bears R Us', '123 Main Street', 'Bear Town'),
 ('DLL01', 'Doll House Inc.', '555 High Street', 'Dollsville'),
 ('FNG01', 'Fun and Games', '42 Galaxy Road', 'London'),
 ('FRB01', 'Furball Inc.', '1000 5th Avenue', 'New York'),
 ('JTS01', 'Jouets et ours', '1 Rue Amusement', 'Paris')]

In [61]:
%sql SELECT prod_id, prod_price, ROUND(0.9*prod_price,2) AS sale_price FROM Products;

 * sqlite:///TYSQL.sqlite
Done.

[('BR01', 5.99, 5.39),
 ('BR02', 8.99, 8.09),
 ('BR03', 11.99, 10.79),
 ('BNBG01', 3.49, 3.14),
 ('BNBG02', 3.49, 3.14),
 ('BNBG03', 3.49, 3.14),
 ('RGAN01', 4.99, 4.49),
 ('RYL01', 9.49, 8.54),
 ('RYL02', 9.49, 8.54)]

In [66]:
%sql SELECT DATE()

 * sqlite:///TYSQL.sqlite
Done.

[('2020-10-21',)]

In [77]:
%sql SELECT cust_id, cust_name, cust_contact, cust_city, (UPPER(SUBSTR(TRIM(cust_contact), 1,2)) || UPPER(SUBSTR(TRIM(cust_city), 1,3))) AS user_login FROM Customers;

 * sqlite:///TYSQL.sqlite
Done.

[('1000000001', 'Village Toys', 'John Smith', 'Detroit', 'JODET'),
 ('1000000002', 'Kids Place', 'Michelle Green', 'Columbus', 'MICOL'),
 ('1000000003', 'Fun4All', 'Jim Jones', 'Muncie', 'JIMUN'),
 ('1000000004', 'Fun4All', 'Denise L. Stephens', 'Phoenix', 'DEPHO'),
 ('1000000005', 'The Toy Store', 'Kim Howard', 'Chicago', 'KICHI'),
 ('1000000006', 'Toy Land', None, 'New York', None)]

In [92]:
%sql SELECT order_num, order_date FROM Orders WHERE STRFTIME('%m', order_date) = '01' AND STRFTIME('%Y', order_date) = '2020'

 * sqlite:///TYSQL.sqlite
Done.

[(20006, '2020-01-12'), (20007, '2020-01-30')]

In [96]:
%sql SELECT SUM(quantity) AS total_items FROM OrderItems

 * sqlite:///TYSQL.sqlite
Done.

[(1430,)]

In [101]:
%sql SELECT SUM(quantity) AS br01_total FROM OrderItems WHERE prod_id = 'BR01'

 * sqlite:///TYSQL.sqlite
Done.

[(120,)]

In [103]:
%sql SELECT MAX(prod_price) AS max_price FROM Products WHERE prod_price <= 10

 * sqlite:///TYSQL.sqlite
Done.

[(9.49,)]

In [108]:
%sql SELECT prod_name, COUNT(*) AS cnts FROM Products GROUP BY vend_id HAVING prod_name LIKE '%';

 * sqlite:///TYSQL.sqlite
Done.

[('8 inch teddy bear', 3), ('Fish bean bag toy', 4), ('King doll', 2)]

In [110]:
%sql SELECT COUNT(*) AS order_lines FROM OrderItems GROUP BY order_num ORDER BY order_lines

 * sqlite:///TYSQL.sqlite
Done.

[(2,), (3,), (3,), (5,), (5,)]

In [126]:
%sql SELECT vend_id, MIN(prod_price) AS cheapest_item FROM Products GROUP BY vend_id ORDER BY cheapest_item;

 * sqlite:///TYSQL.sqlite
Done.

[('DLL01', 3.49), ('BRS01', 5.99), ('FNG01', 9.49)]

In [125]:
%sql SELECT order_num, COUNT(*) AS cnt FROM OrderItems GROUP BY order_num HAVING SUM(quantity) >= 100 ORDER BY cnt;

 * sqlite:///TYSQL.sqlite
Done.

[(20005, 2), (20009, 3), (20007, 5)]

In [124]:
%sql SELECT order_num, ROUND(SUM(quantity * item_price), 2) AS total FROM OrderItems GROUP BY order_num HAVING total >= 1000 ORDER BY order_num;

 * sqlite:///TYSQL.sqlite
Done.

[(20005, 1648.0), (20007, 1696.0), (20009, 1867.5)]

In [118]:
%sql SELECT * FROM OrderItems LIMIT 1;

 * sqlite:///TYSQL.sqlite
Done.

[(20005, 1, 'BR01', 100, 5.49)]

In [4]:
(0.5) * (3/4) * (0.5) * (29/39)/((0.5) * (30/40) * ( (0.5) * (29/39) + (0.5) * (20/40)) + (0.5) * (10/40) * ( (0.5) * (30/40) + (0.5) * (19/39)))

0.44903225806451613

In [18]:
%sql SELECT order_num, cust_id FROM Orders WHERE order_num IN (SELECT DISTINCT order_num FROM OrderItems WHERE item_price >= 10);

 * sqlite:///TYSQL.sqlite
Done.

[(20005, '1000000001'),
 (20006, '1000000003'),
 (20007, '1000000004'),
 (20008, '1000000005')]

In [22]:
%sql SELECT * FROM Orders WHERE order_num IN (SELECT order_num FROM OrderItems WHERE prod_id LIKE 'BR01') ORDER BY order_date ASC;

 * sqlite:///TYSQL.sqlite
Done.

[(20006, '2020-01-12', '1000000003'), (20005, '2020-05-01', '1000000001')]

In [24]:
%sql SELECT * FROM Customers LIMIT 2;

 * sqlite:///TYSQL.sqlite
Done.

[('1000000001', 'Village Toys', '200 Maple Lane', 'Detroit', 'MI', '44444', 'USA', 'John Smith', 'sales@villagetoys.com'),
 ('1000000002', 'Kids Place', '333 South Lake Drive', 'Columbus', 'OH', '43333', 'USA', 'Michelle Green', None)]

In [26]:
%sql SELECT * FROM Orders;

 * sqlite:///TYSQL.sqlite
Done.

[(20005, '2020-05-01', '1000000001'),
 (20006, '2020-01-12', '1000000003'),
 (20007, '2020-01-30', '1000000004'),
 (20008, '2020-02-03', '1000000005'),
 (20009, '2020-02-08', '1000000001')]

In [35]:
%sql SELECT cust_email FROM Customers WHERE cust_id IN (SELECT cust_id FROM Orders WHERE order_num IN (SELECT order_num FROM OrderItems WHERE prod_id LIKE 'BR01'));

 * sqlite:///TYSQL.sqlite
Done.

[('sales@villagetoys.com',), ('jjones@fun4all.com',)]

In [31]:
%sql SELECT * FROM Orders WHERE order_num IN (SELECT order_num FROM OrderItems WHERE prod_id LIKE 'BR01')

 * sqlite:///TYSQL.sqlite
Done.

[(20005, '2020-05-01', '1000000001'), (20006, '2020-01-12', '1000000003')]

In [36]:
%sql SELECT * FROM Customers LIMIT 5;

 * sqlite:///TYSQL.sqlite
Done.

[('1000000001', 'Village Toys', '200 Maple Lane', 'Detroit', 'MI', '44444', 'USA', 'John Smith', 'sales@villagetoys.com'),
 ('1000000002', 'Kids Place', '333 South Lake Drive', 'Columbus', 'OH', '43333', 'USA', 'Michelle Green', None),
 ('1000000003', 'Fun4All', '1 Sunny Place', 'Muncie', 'IN', '42222', 'USA', 'Jim Jones', 'jjones@fun4all.com'),
 ('1000000004', 'Fun4All', '829 Riverside Drive', 'Phoenix', 'AZ', '88888', 'USA', 'Denise L. Stephens', 'dstephens@fun4all.com'),
 ('1000000005', 'The Toy Store', '4545 53rd Street', 'Chicago', 'IL', '54545', 'USA', 'Kim Howard', 'kim@thetoystore.com')]

In [38]:
%sql SELECT * FROM Orders LIMIT 5;

 * sqlite:///TYSQL.sqlite
Done.

[(20005, '2020-05-01', '1000000001'),
 (20006, '2020-01-12', '1000000003'),
 (20007, '2020-01-30', '1000000004'),
 (20008, '2020-02-03', '1000000005'),
 (20009, '2020-02-08', '1000000001')]

In [53]:
%sql WITH t1 AS (SELECT order_num, ROUND(SUM(quantity * item_price), 2) AS tot_amt FROM OrderItems GROUP BY order_num),

 * sqlite:///TYSQL.sqlite
(sqlite3.OperationalError) no such column: Orders.cust_id
[SQL: WITH t1 AS (SELECT order_num, ROUND(SUM(quantity * item_price), 2) AS tot_amt FROM OrderItems GROUP BY order_num) SELECT Orders.cust_id, t1.tot_amt;]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [54]:
%sql SELECT * FROM Products;

 * sqlite:///TYSQL.sqlite
Done.

[('BR01', 'BRS01', '8 inch teddy bear', 5.99, '8 inch teddy bear, comes with cap and jacket'),
 ('BR02', 'BRS01', '12 inch teddy bear', 8.99, '12 inch teddy bear, comes with cap and jacket'),
 ('BR03', 'BRS01', '18 inch teddy bear', 11.99, '18 inch teddy bear, comes with cap and jacket'),
 ('BNBG01', 'DLL01', 'Fish bean bag toy', 3.49, 'Fish bean bag toy, complete with bean bag worms with which to feed it'),
 ('BNBG02', 'DLL01', 'Bird bean bag toy', 3.49, 'Bird bean bag toy, eggs are not included'),
 ('BNBG03', 'DLL01', 'Rabbit bean bag toy', 3.49, 'Rabbit bean bag toy, comes with bean bag carrots'),
 ('RGAN01', 'DLL01', 'Raggedy Ann', 4.99, '18 inch Raggedy Ann doll'),
 ('RYL01', 'FNG01', 'King doll', 9.49, '12 inch king doll with royal garments and crown'),
 ('RYL02', 'FNG01', 'Queen doll', 9.49, '12 inch queen doll with royal garments and crown')]

In [63]:
%sql SELECT prod_id, (SELECT SUM(quantity) FROM OrderItems WHERE Products.prod_id=OrderItems.prod_id) AS tot_qty FROM Products;

 * sqlite:///TYSQL.sqlite
Done.

[('BNBG01', 360),
 ('BNBG02', 360),
 ('BNBG03', 360),
 ('BR01', 120),
 ('BR02', 10),
 ('BR03', 165),
 ('RGAN01', 55),
 ('RYL01', None),
 ('RYL02', None)]

In [61]:
%sql SELECT prod_id, SUM(quantity) FROM OrderItems GROUP BY prod_id

 * sqlite:///TYSQL.sqlite
Done.

[('BNBG01', 360),
 ('BNBG02', 360),
 ('BNBG03', 360),
 ('BR01', 120),
 ('BR02', 10),
 ('BR03', 165),
 ('RGAN01', 55)]

In [90]:
%sql SELECT * FROM Customers LIMIT 5;

 * sqlite:///TYSQL.sqlite
Done.

[('1000000001', 'Village Toys', '200 Maple Lane', 'Detroit', 'MI', '44444', 'USA', 'John Smith', 'sales@villagetoys.com'),
 ('1000000002', 'Kids Place', '333 South Lake Drive', 'Columbus', 'OH', '43333', 'USA', 'Michelle Green', None),
 ('1000000003', 'Fun4All', '1 Sunny Place', 'Muncie', 'IN', '42222', 'USA', 'Jim Jones', 'jjones@fun4all.com'),
 ('1000000004', 'Fun4All', '829 Riverside Drive', 'Phoenix', 'AZ', '88888', 'USA', 'Denise L. Stephens', 'dstephens@fun4all.com'),
 ('1000000005', 'The Toy Store', '4545 53rd Street', 'Chicago', 'IL', '54545', 'USA', 'Kim Howard', 'kim@thetoystore.com')]

In [91]:
%sql SELECT * FROM Orders LIMIT 5;

 * sqlite:///TYSQL.sqlite
Done.

[(20005, '2020-05-01', '1000000001'),
 (20006, '2020-01-12', '1000000003'),
 (20007, '2020-01-30', '1000000004'),
 (20008, '2020-02-03', '1000000005'),
 (20009, '2020-02-08', '1000000001')]

In [95]:
%sql SELECT cust_name, order_num FROM Customers, Orders WHERE Customers.cust_id=Orders.cust_id;

 * sqlite:///TYSQL.sqlite
Done.

[('Village Toys', 20005),
 ('Fun4All', 20006),
 ('Fun4All', 20007),
 ('The Toy Store', 20008),
 ('Village Toys', 20009)]

In [116]:
%%sql 
SELECT cust_name, t1.order_num, t1.tot_amt 
FROM Orders 
INNER JOIN Customers 
ON Orders.cust_id=Customers.cust_id 
INNER JOIN (SELECT OrderItems.order_num, ROUND(SUM(quantity * item_price), 2) AS tot_amt
            FROM OrderItems
            GROUP BY OrderItems.order_num) AS t1
ON t1.order_num=Orders.order_num;

 * sqlite:///TYSQL.sqlite
Done.

[('Village Toys', 20005, 1648.0),
 ('Fun4All', 20006, 329.6),
 ('Fun4All', 20007, 1696.0),
 ('The Toy Store', 20008, 189.6),
 ('Village Toys', 20009, 1867.5)]

In [111]:
%%sql 
SELECT order_num, ROUND(SUM(quantity * item_price), 2) AS tot_amt 
FROM OrderItems 
GROUP BY order_num
LIMIT 5;

 * sqlite:///TYSQL.sqlite
Done.

[(20005, 1648.0),
 (20006, 329.6),
 (20007, 1696.0),
 (20008, 189.6),
 (20009, 1867.5)]

In [136]:
%sql SELECT * FROM OrderItems LIMIT 1;

 * sqlite:///TYSQL.sqlite
Done.

[(20005, 1, 'BR01', 100, 5.49)]

In [125]:
%%sql 
SELECT OrderItems.order_num, order_date
FROM Orders, OrderItems
WHERE Orders.order_num=OrderItems.order_num
AND OrderItems.prod_id='BR01';

 * sqlite:///TYSQL.sqlite
Done.

[(20005, '2020-05-01'), (20006, '2020-01-12')]

In [131]:
%%sql 
SELECT OrderItems.order_num, order_date
FROM Orders
INNER JOIN OrderItems
ON Orders.order_num=OrderItems.order_num
WHERE OrderItems.prod_id='BR01';

 * sqlite:///TYSQL.sqlite
Done.

[(20005, '2020-05-01'), (20006, '2020-01-12')]

In [135]:
%%sql 
SELECT OrderItems.order_num, order_date, Orders.cust_id, cust_email
FROM Orders
INNER JOIN OrderItems
ON Orders.order_num=OrderItems.order_num
INNER JOIN Customers
ON Orders.cust_id=Customers.cust_id
WHERE OrderItems.prod_id='BR01';

 * sqlite:///TYSQL.sqlite
Done.

[(20005, '2020-05-01', '1000000001', 'sales@villagetoys.com'),
 (20006, '2020-01-12', '1000000003', 'jjones@fun4all.com')]

In [143]:
%%sql
SELECT Orders.order_num, Customers.cust_id, Customers.cust_name, ROUND(SUM(quantity*item_price),2) AS tot_amt
FROM OrderItems 
INNER JOIN Orders
ON Orders.order_num=OrderItems.order_num
INNER JOIN Customers
ON Orders.cust_id=Customers.cust_id
GROUP BY Orders.order_num
HAVING tot_amt >= 1000

 * sqlite:///TYSQL.sqlite
Done.

[(20005, '1000000001', 'Village Toys', 1648.0),
 (20007, '1000000004', 'Fun4All', 1696.0),
 (20009, '1000000001', 'Village Toys', 1867.5)]

In [140]:
%%sql
SELECT order_num, ROUND(SUM(quantity*item_price),2) AS tot_amt
FROM OrderItems 
GROUP BY order_num
HAVING tot_amt >= 1000

 * sqlite:///TYSQL.sqlite
Done.

[(20005, 1648.0), (20007, 1696.0), (20009, 1867.5)]

In [141]:
%%sql
SELECT *
FROM Orders;

 * sqlite:///TYSQL.sqlite
Done.

[(20005, '2020-05-01', '1000000001'),
 (20006, '2020-01-12', '1000000003'),
 (20007, '2020-01-30', '1000000004'),
 (20008, '2020-02-03', '1000000005'),
 (20009, '2020-02-08', '1000000001')]

In [148]:
%%sql
SELECT Customers.cust_name, Orders.order_num 
FROM Customers, Orders
WHERE Customers.cust_id = Orders.cust_id

 * sqlite:///TYSQL.sqlite
Done.

[('Village Toys', 20005),
 ('Fun4All', 20006),
 ('Fun4All', 20007),
 ('The Toy Store', 20008),
 ('Village Toys', 20009)]

In [149]:
%%sql
SELECT Customers.cust_name, Orders.order_num 
FROM Customers
INNER JOIN Orders
ON Customers.cust_id = Orders.cust_id

 * sqlite:///TYSQL.sqlite
Done.

[('Village Toys', 20005),
 ('Fun4All', 20006),
 ('Fun4All', 20007),
 ('The Toy Store', 20008),
 ('Village Toys', 20009)]

In [150]:
%%sql
SELECT Customers.cust_name, Orders.order_num 
FROM Customers
LEFT JOIN Orders
ON Customers.cust_id = Orders.cust_id

 * sqlite:///TYSQL.sqlite
Done.

[('Village Toys', 20005),
 ('Village Toys', 20009),
 ('Kids Place', None),
 ('Fun4All', 20006),
 ('Fun4All', 20007),
 ('The Toy Store', 20008),
 ('Toy Land', None)]

In [178]:
%sql SELECT * FROM OrderItems ORDER BY prod_id;

 * sqlite:///TYSQL.sqlite
Done.

[(20007, 2, 'BNBG01', 100, 2.99),
 (20008, 3, 'BNBG01', 10, 3.49),
 (20009, 1, 'BNBG01', 250, 2.49),
 (20007, 3, 'BNBG02', 100, 2.99),
 (20008, 4, 'BNBG02', 10, 3.49),
 (20009, 2, 'BNBG02', 250, 2.49),
 (20007, 4, 'BNBG03', 100, 2.99),
 (20008, 5, 'BNBG03', 10, 3.49),
 (20009, 3, 'BNBG03', 250, 2.49),
 (20005, 1, 'BR01', 100, 5.49),
 (20006, 1, 'BR01', 20, 5.99),
 (20006, 2, 'BR02', 10, 8.99),
 (20005, 2, 'BR03', 100, 10.99),
 (20006, 3, 'BR03', 10, 11.99),
 (20007, 1, 'BR03', 50, 11.49),
 (20008, 2, 'BR03', 5, 11.99),
 (20007, 5, 'RGAN01', 50, 4.49),
 (20008, 1, 'RGAN01', 5, 4.99)]

In [181]:
%%sql 
SELECT Products.prod_id, prod_name, order_num
FROM Products
LEFT JOIN OrderItems
ON Products.prod_id = OrderItems.prod_id
UNION
SELECT Products.prod_id, prod_name, order_num 
FROM OrderItems
LEFT JOIN Products
ON Products.prod_id = OrderItems.prod_id
GROUP BY Products.prod_id
ORDER BY Products.prod_id, order_num, prod_name;

 * sqlite:///TYSQL.sqlite
Done.

[('BNBG01', 'Fish bean bag toy', 20007),
 ('BNBG01', 'Fish bean bag toy', 20008),
 ('BNBG01', 'Fish bean bag toy', 20009),
 ('BNBG02', 'Bird bean bag toy', 20007),
 ('BNBG02', 'Bird bean bag toy', 20008),
 ('BNBG02', 'Bird bean bag toy', 20009),
 ('BNBG03', 'Rabbit bean bag toy', 20007),
 ('BNBG03', 'Rabbit bean bag toy', 20008),
 ('BNBG03', 'Rabbit bean bag toy', 20009),
 ('BR01', '8 inch teddy bear', 20005),
 ('BR01', '8 inch teddy bear', 20006),
 ('BR02', '12 inch teddy bear', 20006),
 ('BR03', '18 inch teddy bear', 20005),
 ('BR03', '18 inch teddy bear', 20006),
 ('BR03', '18 inch teddy bear', 20007),
 ('BR03', '18 inch teddy bear', 20008),
 ('RGAN01', 'Raggedy Ann', 20007),
 ('RGAN01', 'Raggedy Ann', 20008),
 ('RYL01', 'King doll', None),
 ('RYL02', 'Queen doll', None)]

In [180]:
%sql SELECT * FROM Products;

 * sqlite:///TYSQL.sqlite
Done.

[('BR01', 'BRS01', '8 inch teddy bear', 5.99, '8 inch teddy bear, comes with cap and jacket'),
 ('BR02', 'BRS01', '12 inch teddy bear', 8.99, '12 inch teddy bear, comes with cap and jacket'),
 ('BR03', 'BRS01', '18 inch teddy bear', 11.99, '18 inch teddy bear, comes with cap and jacket'),
 ('BNBG01', 'DLL01', 'Fish bean bag toy', 3.49, 'Fish bean bag toy, complete with bean bag worms with which to feed it'),
 ('BNBG02', 'DLL01', 'Bird bean bag toy', 3.49, 'Bird bean bag toy, eggs are not included'),
 ('BNBG03', 'DLL01', 'Rabbit bean bag toy', 3.49, 'Rabbit bean bag toy, comes with bean bag carrots'),
 ('RGAN01', 'DLL01', 'Raggedy Ann', 4.99, '18 inch Raggedy Ann doll'),
 ('RYL01', 'FNG01', 'King doll', 9.49, '12 inch king doll with royal garments and crown'),
 ('RYL02', 'FNG01', 'Queen doll', 9.49, '12 inch queen doll with royal garments and crown')]

In [188]:
%%sql
SELECT prod_id, quantity
FROM OrderItems
WHERE quantity = 100
UNION
SELECT prod_id, quantity
FROM OrderItems
WHERE prod_id LIKE 'BNBG%';

 * sqlite:///TYSQL.sqlite
Done.

[('BNBG01', 10),
 ('BNBG01', 100),
 ('BNBG01', 250),
 ('BNBG02', 10),
 ('BNBG02', 100),
 ('BNBG02', 250),
 ('BNBG03', 10),
 ('BNBG03', 100),
 ('BNBG03', 250),
 ('BR01', 100),
 ('BR03', 100)]

In [189]:
%%sql
SELECT prod_id, quantity
FROM OrderItems
WHERE quantity = 100
OR prod_id LIKE 'BNBG%';

 * sqlite:///TYSQL.sqlite
Done.

[('BR01', 100),
 ('BR03', 100),
 ('BNBG01', 100),
 ('BNBG02', 100),
 ('BNBG03', 100),
 ('BNBG01', 10),
 ('BNBG02', 10),
 ('BNBG03', 10),
 ('BNBG01', 250),
 ('BNBG02', 250),
 ('BNBG03', 250)]

In [190]:
%%sql
SELECT prod_name
FROM Products
UNION
SELECT cust_name
FROM Customers
ORDER BY prod_name;

 * sqlite:///TYSQL.sqlite
Done.

[('12 inch teddy bear',),
 ('18 inch teddy bear',),
 ('8 inch teddy bear',),
 ('Bird bean bag toy',),
 ('Fish bean bag toy',),
 ('Fun4All',),
 ('Kids Place',),
 ('King doll',),
 ('Queen doll',),
 ('Rabbit bean bag toy',),
 ('Raggedy Ann',),
 ('The Toy Store',),
 ('Toy Land',),
 ('Village Toys',)]

In [191]:
%sql SELECT * INTO Baba FROM Customers;

 * sqlite:///TYSQL.sqlite
(sqlite3.OperationalError) near "INTO": syntax error
[SQL: SELECT * INTO Baba FROM Customers;]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [192]:
%sql SELECT * FROM Customers ORDER BY cust_name ASC LIMIT 1;

 * sqlite:///TYSQL.sqlite
Done.

[('1000000003', 'Fun4All', '1 Sunny Place', 'Muncie', 'IN', '42222', 'USA', 'Jim Jones', 'jjones@fun4all.com')]

In [226]:
%%sql
INSERT INTO Customers(cust_id, 
                      cust_name, 
                      cust_address, 
                      cust_city, 
                      cust_state, 
                      cust_zip, 
                      cust_country, 
                      cust_contact, 
                      cust_email)
VALUES (1000000009, 'Yoyo', '1 Yo Pl', 'Yoland', 'YL', 38675, 'USA', 'Yo Si', 'yo@yo');

 * sqlite:///TYSQL.sqlite
1 rows affected.

[]

In [197]:
%sql CREATE TABLE Orders_Bkp AS SELECT * FROM Orders;

 * sqlite:///TYSQL.sqlite
Done.

[]

In [198]:
%sql CREATE TABLE OrderItems_Bkp AS SELECT * FROM OrderItems;

 * sqlite:///TYSQL.sqlite
Done.

[]

In [205]:
%%sql
UPDATE Customers
SET cust_email=NULL
WHERE cust_email LIKE 'yo@%';

 * sqlite:///TYSQL.sqlite
1 rows affected.

[]

In [206]:
%sql SELECT * FROM Customers;

 * sqlite:///TYSQL.sqlite
Done.

[('1000000001', 'Village Toys', '200 Maple Lane', 'Detroit', 'MI', '44444', 'USA', 'John Smith', 'sales@villagetoys.com'),
 ('1000000002', 'Kids Place', '333 South Lake Drive', 'Columbus', 'OH', '43333', 'USA', 'Michelle Green', None),
 ('1000000003', 'Fun4All', '1 Sunny Place', 'Muncie', 'IN', '42222', 'USA', 'Jim Jones', 'jjones@fun4all.com'),
 ('1000000004', 'Fun4All', '829 Riverside Drive', 'Phoenix', 'AZ', '88888', 'USA', 'Denise L. Stephens', 'dstephens@fun4all.com'),
 ('1000000005', 'The Toy Store', '4545 53rd Street', 'Chicago', 'IL', '54545', 'USA', 'Kim Howard', 'kim@thetoystore.com'),
 ('1000000006', 'Toy Land', '123 Any Street', 'New York', 'NY', '11111', 'USA', None, None),
 ('1000000009', 'Yoyo', '1 Yo Pl', 'Yoland', 'YL', '38675', 'USA', 'Yo Si', None)]

In [211]:
%%sql
UPDATE Vendors
SET vend_state = UPPER(vend_state)
WHERE vend_id IS NOT NULL;

 * sqlite:///TYSQL.sqlite
6 rows affected.

[]

In [213]:
%%sql
UPDATE Customers
SET cust_state = UPPER(cust_state)
WHERE cust_id IS NOT NULL;

 * sqlite:///TYSQL.sqlite
7 rows affected.

[]

In [215]:
%%sql
DELETE FROM Customers
WHERE cust_id=1000000009;

 * sqlite:///TYSQL.sqlite
1 rows affected.

[]

In [216]:
%%sql SELECT *
FROM Customers;

 * sqlite:///TYSQL.sqlite
Done.

[('1000000001', 'Village Toys', '200 Maple Lane', 'Detroit', 'MI', '44444', 'USA', 'John Smith', 'sales@villagetoys.com'),
 ('1000000002', 'Kids Place', '333 South Lake Drive', 'Columbus', 'OH', '43333', 'USA', 'Michelle Green', None),
 ('1000000003', 'Fun4All', '1 Sunny Place', 'Muncie', 'IN', '42222', 'USA', 'Jim Jones', 'jjones@fun4all.com'),
 ('1000000004', 'Fun4All', '829 Riverside Drive', 'Phoenix', 'AZ', '88888', 'USA', 'Denise L. Stephens', 'dstephens@fun4all.com'),
 ('1000000005', 'The Toy Store', '4545 53rd Street', 'Chicago', 'IL', '54545', 'USA', 'Kim Howard', 'kim@thetoystore.com'),
 ('1000000006', 'Toy Land', '123 Any Street', 'New York', 'NY', '11111', 'USA', None, None)]

In [217]:
%sql ALTER TABLE Vendors ADD COLUMN vend_web VARCHAR(100) NOT NULL DEFAULT 'abc@example.com';

 * sqlite:///TYSQL.sqlite
Done.

[]

In [218]:
%sql SELECT * FROM Vendors;

 * sqlite:///TYSQL.sqlite
Done.

[('BRS01', 'Bears R Us', '123 Main Street', 'Bear Town', 'MI', '44444', 'USA', 'abc@example.com'),
 ('BRE02', 'Bear Emporium', '500 Park Street', 'Anytown', 'OH', '44333', 'USA', 'abc@example.com'),
 ('DLL01', 'Doll House Inc.', '555 High Street', 'Dollsville', 'CA', '99999', 'USA', 'abc@example.com'),
 ('FRB01', 'Furball Inc.', '1000 5th Avenue', 'New York', 'NY', '11111', 'USA', 'abc@example.com'),
 ('FNG01', 'Fun and Games', '42 Galaxy Road', 'London', None, 'N16 6PS', 'England', 'abc@example.com'),
 ('JTS01', 'Jouets et ours', '1 Rue Amusement', 'Paris', None, '45678', 'France', 'abc@example.com')]

In [224]:
%%sql 
CREATE VIEW CustomersWithOrders AS
SELECT * 
FROM Customers
INNER JOIN Orders
ON Customers.cust_id=Orders.cust_id;

 * sqlite:///TYSQL.sqlite
Done.

[]

In [225]:
%sql SELECT * FROM CustomersWithOrders;

 * sqlite:///TYSQL.sqlite
Done.

[('1000000001', 'Village Toys', '200 Maple Lane', 'Detroit', 'MI', '44444', 'USA', 'John Smith', 'sales@villagetoys.com', 20005, '2020-05-01', '1000000001'),
 ('1000000003', 'Fun4All', '1 Sunny Place', 'Muncie', 'IN', '42222', 'USA', 'Jim Jones', 'jjones@fun4all.com', 20006, '2020-01-12', '1000000003'),
 ('1000000004', 'Fun4All', '829 Riverside Drive', 'Phoenix', 'AZ', '88888', 'USA', 'Denise L. Stephens', 'dstephens@fun4all.com', 20007, '2020-01-30', '1000000004'),
 ('1000000005', 'The Toy Store', '4545 53rd Street', 'Chicago', 'IL', '54545', 'USA', 'Kim Howard', 'kim@thetoystore.com', 20008, '2020-02-03', '1000000005'),
 ('1000000001', 'Village Toys', '200 Maple Lane', 'Detroit', 'MI', '44444', 'USA', 'John Smith', 'sales@villagetoys.com', 20009, '2020-02-08', '1000000001')]

In [227]:
%%sql 
CREATE VIEW Custu AS
SELECT * 
FROM Customers;

 * sqlite:///TYSQL.sqlite
Done.

[]

In [232]:
%sql SELECT * FROM Custu

 * sqlite:///TYSQL.sqlite
Done.

[('1000000001', 'Village Toys', '200 Maple Lane', 'Detroit', 'MI', '44444', 'USA', 'John Smith', 'sales@villagetoys.com'),
 ('1000000002', 'Kids Place', '333 South Lake Drive', 'Columbus', 'OH', '43333', 'USA', 'Michelle Green', None),
 ('1000000003', 'Fun4All', '1 Sunny Place', 'Muncie', 'IN', '42222', 'USA', 'Jim Jones', 'jjones@fun4all.com'),
 ('1000000004', 'Fun4All', '829 Riverside Drive', 'Phoenix', 'AZ', '88888', 'USA', 'Denise L. Stephens', 'dstephens@fun4all.com'),
 ('1000000005', 'The Toy Store', '4545 53rd Street', 'Chicago', 'IL', '54545', 'USA', 'Kim Howard', 'kim@thetoystore.com'),
 ('1000000006', 'Toy Land', '123 Any Street', 'New York', 'NY', '11111', 'USA', None, None)]

In [231]:
%sql DELETE FROM Customers WHERE cust_name = 'Yoyo'

 * sqlite:///TYSQL.sqlite
1 rows affected.

[]